Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: You can define and undefine pre-processor macros with the ``define_macros`` and ``undef_macros`` options. ``define_macros`` takes a list of ``(name, value)`` tuples, where ``name`` is the name of the macro to define (a string) and ``value`` is its value: either a string or ``None``. (Defining a macro ``FOO`` to ``None`` is the equivalent of a bare ``#define FOO`` in your C source: with most compilers, this sets ``FOO`` to the string ``1``.) ``undef_macros`` is just a list of macros to undefine.
pl: Możesz definiować i odwoływać definicje makropoleceń pre-procesora za pomocą opcji ``define_macros`` i ``undef_macros``. ``define_macros`` bierze listę ``(nazwy, wartości)`` par-krotek, gdzie ``nazwa`` jest nazwą makropolecenia do zdefiniowania (ciągiem znaków) i ``wartość`` jest jej wartością: albo ciągiem znaków albo ``None``. Definiowanie makropolecenia ``FOO`` na ``None`` jest równoznaczne czystej definicji ``#define FOO`` w twoim kodzie C: w większości kompilatorów, to ustawia ``FOO`` na ciąg znaków ``1``. ``undef_macros`` jest po prostu listą makropoleceń do odwołania definicji.

source: For example::
pl: Dla przykładu::

source: is the equivalent of having this at the top of every C source file::
pl: jest jednoznaczne z ustawieniem tego ponad każdym plikiem źródłowym C::

source: Library options
pl: Opcje bibliotek

source: You can also specify the libraries to link against when building your extension, and the directories to search for those libraries. The ``libraries`` option is a list of libraries to link against, ``library_dirs`` is a list of directories to search for libraries at link-time, and ``runtime_library_dirs`` is a list of directories to search for shared (dynamically loaded) libraries at run-time.
pl: Możesz także określić biblioteki do dołączenia gdy budujesz swoje rozszerzenie, i katalogi aby poszukiwać tych bibliotek. Opcja ``biblioteki`` jest listą bibliotek do łączenia, opcja ``library_dirs`` jest listą katalogów do poszukiwania bibliotek w czasie łączenia wynikowego kodu, i ``runtime_library_dirs`` jest listą katalogów do poszukiwania współdzielonych (ładowanych dynamicznie) bibliotek w czasie wykonania.

source: For example, if you need to link against libraries known to be in the standard library search path on target systems ::
pl: Dla przykładu, jeśli potrzebujesz łączyć z bibliotekami znanymi z tego, że są w standardowej ścieżce poszukiwań w docelowym systemie ::

source: If you need to link with libraries in a non-standard location, you'll have to include the location in ``library_dirs``::
pl: Jeśli musisz podłączyć z bibliotekami w nie-standardowym położeniu, musisz załączyć to położenie w opcji ``library_dirs``::

source: (Again, this sort of non-portable construct should be avoided if you intend to distribute your code.)
pl: (Znów, tego rodzaju nie-przenośnych konstrukcji powinno się unikać jeśli zamierzasz rozprowadzać twój kod.)

source: **\*\*** Should mention clib libraries here or somewhere else! **\*\***
pl: **\*\*** Powinno się wspomnieć biblioteki clib tutaj lub gdzieś indziej! **\*\***

source: Other options
pl: Inne opcje

source: There are still some other options which can be used to handle special cases.
pl: Istnieją wciąż poza tym inne opcje, które mogą być użyte do radzenia sobie ze szczególnymi przypadkami.

source: The :option:`optional` option is a boolean; if it is true, a build failure in the extension will not abort the build process, but instead simply not install the failing extension.
pl: Opcja :option:`optional` jest typu boolean; Jeśli jest prawdziwa, błąd budowy rozszerzenia nie przerwie procesu budowania, ale zamiast tego po prostu nie zainstaluje zawodzącego rozszerzenia.

source: The :option:`extra_objects` option is a list of object files to be passed to the linker. These files must not have extensions, as the default extension for the compiler is used.
pl: Opcja :option:`extra_objects` jest listą plików przedmiotowych do przekazania do programu łączącego pliki wynikowe. Te pliki nie mogą mieć rozszerzenia, gdyż domyślnym rozszerzenie kompilatora jest używane.

source: :option:`extra_compile_args` and :option:`extra_link_args` can be used to specify additional command line options for the respective compiler and linker command lines.
pl: Opcja :option:`extra_compile_args` i opcja :option:`extra_link_args` może być używana do określenia dodatkowych opcji wiersza polecenia dla wierszy poleceń odpowiadających kompilatora i programu łączącego pliki wynikowe.

source: :option:`export_symbols` is only useful on Windows. It can contain a list of symbols (functions or variables) to be exported. This option is not needed when building compiled extensions: Distutils will automatically add ``initmodule`` to the list of exported symbols.
pl: Opcja :option:`export_symbols` jest użyteczna tylko w Windows. Może pomieścić listę symboli (zadań lub zmiennych) do eksportu. Ta opcja nie jest wymagana gdy budujemy skompilowane rozszerzenia: Distutils automatycznie dodaje ``initmodule`` do listy symboli wystawianych na zewnątrz.

source: The :option:`depends` option is a list of files that the extension depends on (for example header files). The build command will call the compiler on the sources to rebuild extension if any on this files has been modified since the previous build.
pl: Opcja :option:`depends` jest listą plików od których rozszerzenie zależy (na przykład plików nagłówkowych). Polecenie budowania uruchamia kompilator na źródłach do ponownego zbudowania rozszerzenia jeśli któreś z jego plików zostało zmodyfikowane od czasu poprzedniej budowy.

source: Relationships between Distributions and Packages
pl: Relacje pomiędzy dystrybucją a pakietami

source: A distribution may relate to packages in three specific ways:
pl: Dystrybucja może odnosić się do pakietów na trzy szczególne sposoby:

source: It can require packages or modules.
pl: Może wymagać pakietów lub modułów.

source: It can provide packages or modules.
pl: Może dostarczać pakiety lub moduły.

source: It can obsolete packages or modules.
pl: Może powodować że pakiety lub moduły staną się niepotrzebne.

source: These relationships can be specified using keyword arguments to the :func:`distutils.core.setup` function.
pl: Te relacje mogą być określane przy użyciu kluczowych parametrów zadania :func:`distutils.core.setup`.

source: Dependencies on other Python modules and packages can be specified by supplying the *requires* keyword argument to :func:`setup`. The value must be a list of strings. Each string specifies a package that is required, and optionally what versions are sufficient.
pl: Zależności od innych modułów pytonowskich i pakietów mogą być określane przez dostarczenie słowa kluczowego *requires* jako parametru do zadania :func:`setup`. Wartość musi być listą ciągów znaków. Każdy ciąg znaków określa pakiet, który jest wymagany, i opcjonalnie które wersje są wystarczające.

source: To specify that any version of a module or package is required, the string should consist entirely of the module or package name. Examples include ``'mymodule'`` and ``'xml.parsers.expat'``.
pl: Aby określić, że któraś wersja modułu lub pakietu jest wymagana, ciąg znaków powinien składać się w całości z nazwy modułu lub pakietu. Przykłady obejmują ``'mojmodul'`` i ``'xml.parsers.expat'``.

source: If specific versions are required, a sequence of qualifiers can be supplied in parentheses. Each qualifier may consist of a comparison operator and a version number. The accepted comparison operators are::
pl: Jeśli szczególne wersje są wymagane, sekwencja kwalifikatorów może być dostarczona w nawiasach. Każdy kwalifikator może składać się z operatora porównania i numeru wersji. Akceptowane operatory porównania to::

source: These can be combined by using multiple qualifiers separated by commas (and optional whitespace). In this case, all of the qualifiers must be matched; a logical AND is used to combine the evaluations.
pl: Te mogą być łączone przez użycie wielu kwalifikatorów rozdzielonych przecinkami (i nadobowiązkowymi znakami białymi). W tym przypadku, wszystkie kwalifikatory muszą się zgadzać; logiczna koniunkcja jest używana do wiązania wyników.

source: Let's look at a bunch of examples:
pl: Spójrzmy na wiecheć przykładów:

source: Requires Expression
pl: Wyrażenie wymagania

source: Explanation
pl: Wytłumaczenie

source: Only version ``1.0`` is compatible
pl: Tylko wersja ``1.0`` jest zgodna

source: Any version after ``1.0`` and before ``2.0`` is compatible, except ``1.5.1``
pl: Wszystkie wersje po ``1.0`` i przed ``2.0`` są zgodne z wyjątkiem ``1.5.1``

source: Now that we can specify dependencies, we also need to be able to specify what we provide that other distributions can require. This is done using the *provides* keyword argument to :func:`setup`. The value for this keyword is a list of strings, each of which names a Python module or package, and optionally identifies the version. If the version is not specified, it is assumed to match that of the distribution.
pl: Teraz gdy możemy określić zależności, potrzebujemy także móc określić co dostarczamy a czego inne dystrybucje mogłyby wymagać. To jest dokonywane przy użyciu parametru kluczowego *provides* dla zadania :func:`setup`. Wartość tego słowa kluczowego jest listą ciągów znaków, z których każdy nazywa pytonowski moduł lub pakiet, i dodatkowo (nadobowiązkowo) określa wersję. Jeśli wersja nie jest określona, zakładana jest zgodność wersji z wersją dystrybucji.

source: Some examples:
pl: Trochę przykładów:

source: Provides Expression
pl: Wyrażenie dostarczania

source: ``mypkg``
pl: ``mojpakiet``

source: Provide ``mypkg``, using the distribution version
pl: Dostarcza ``mojpakiet``, używając wersji dystrybucji

source: ``mypkg (1.1)``
pl: ``mojpakiet (1.1)``

source: Provide ``mypkg`` version 1.1, regardless of the distribution version
pl: Dostarcz ``mojpakiet`` w wersji 1.1, niezależnie od wersji dystrybucji

source: A package can declare that it obsoletes other packages using the *obsoletes* keyword argument. The value for this is similar to that of the *requires* keyword: a list of strings giving module or package specifiers. Each specifier consists of a module or package name optionally followed by one or more version qualifiers. Version qualifiers are given in parentheses after the module or package name.
pl: Pakiet może deklarować że powoduje że inny pakiet staje się niepotrzebny używając parametru kluczowego *obsoletes*. Wartość tego jest podobna do tej słowa kluczowego *requires*: lista ciągów znaków dających wyszczególnienie modułu lub pakietu. Każdy ciąg wyszczególniający składa się z nazwy modułu lub pakietu po której dodatkowo (nadobowiązkowo) występuje jeden lub więcej kwalifikator wersji. Kwalifikatory wersji dane są w nawiasie po nazwie modułu lub pakietu.

source: The versions identified by the qualifiers are those that are obsoleted by the distribution being described. If no qualifiers are given, all versions of the named module or package are understood to be obsoleted.
pl: Wersje określone przez kwalifikatory to te które stają się zbędne z powodu dystrybucji której dotyczy opis. Jeśli nie są dane żadne kwalifikatory wszystkie wersje nazwanego modułu lub pakietu rozumie się jako zbędne.

source: Installing Scripts
pl: Instalowanie skryptów

source: So far we have been dealing with pure and non-pure Python modules, which are usually not run by themselves but imported by scripts.
pl: Do tej pory zajmowaliśmy się czystymi i nie-czystymi modułami pytonowskimi, które nie są zwykle uruchamiane same przez siebie ale importowane przez skrypty.

source: Scripts are files containing Python source code, intended to be started from the command line. Scripts don't require Distutils to do anything very complicated. The only clever feature is that if the first line of the script starts with ``#!`` and contains the word "python", the Distutils will adjust the first line to refer to the current interpreter location. By default, it is replaced with the current interpreter location. The :option:`--executable` (or :option:`-e`) option will allow the interpreter path to be explicitly overridden.
pl: Skrypty są plikami zawierającymi kod źródłowy języka pytonowskiego, przeznaczonymi do uruchamiania z wiersza poleceń. Skrypty nie wymagają aby Distutils robiło nic skomplikowanego. Jedyną sprytną sprawą jest to że jeśli pierwsza linia skryptu zaczyna się od ``#!`` i zawiera słowo "python", wtedy Distutils dostosuje pierwszą linię aby odnosiła sę do aktualnego miejsca z którego uruchomiony został program interpretujący polecenia języka pytonowskiego. Domyślnie jest to zamieniane na miejsce aktualnego programu interpretującego polecenia języka pytonowskiego. Opcja :option:`--executable` (lub opcja :option:`-e`) pozwala na jawną zamianę ścieżki dostępu do wykonywalnego programu interpretującego polecenia języka pytonowskiego.

source: The :option:`scripts` option simply is a list of files to be handled in this way. From the PyXML setup script::
pl: Opcja :option:`scripts` po prostu jest listą plików do przetworzenia w ten sposób. Ze skryptu instalacyjnego PyXML::

source: Installing Package Data
pl: Instalowanie danych pakietu

source: Often, additional files need to be installed into a package. These files are often data that's closely related to the package's implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called :dfn:`package data`.
pl: Często dodatkowe pliki konieczne są do zainstalowania dla pakietu. Te pliki są często plikami danych które są blisko związane z wypełnieniem zadań pakietu, lub plikami tekstowymi zawierającymi dokumentację która może być interesująca dla programisty używającego pakietu. Te pliki zwane są :dfn:`danymi pakietu`.

source: Package data can be added to packages using the ``package_data`` keyword argument to the :func:`setup` function. The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package (information from the ``package_dir`` mapping is used if appropriate); that is, the files are expected to be part of the package in the source directories. They may contain glob patterns as well.
pl: Dane pakietu mogą być dodawane do pakietów używając słowa kluczowego ``package_data`` - z ang. - ``danych pakietu`` parametru dla zadania :func:`setup`. Wartość musi być mapowaniem z nazwy pakietu na listę odnoszących się nazw ścieżek które powinny zostać skopiowane do pakietu. Ścieżki są interpretowane jako względne do katalogu zawierającego pakiet (informacja z mapowania ``package_dir`` jest używana jeśli jest to właściwe); to jest, pliki oczekiwane są aby były częścią pakietu w katalogach źródłowych. Mogą zawierać znaczniki "globalne" także.

source: The path names may contain directory portions; any necessary directories will be created in the installation.
pl: Nazwy ścieżek mogą zawierać porcje katalogów; wszystkie konieczne katalogi zostaną utworzone w instalacji.

source: For example, if a package should contain a subdirectory with several data files, the files can be arranged like this in the source tree::
pl: Na przykład, jeśli pakiet zawiera podkatalog z wieloma plikami danych, pliki mogą być ułożone w taki sposób w drzewie źródłowym::

source: The corresponding call to :func:`setup` might be::
pl: Odpowiadające wezwanie zadania :func:`setup` mogłoby być::

source: Installing Additional Files
pl: Instalowanie dodatkowych plików

source: The :option:`data_files` option can be used to specify additional files needed by the module distribution: configuration files, message catalogs, data files, anything which doesn't fit in the previous categories.
pl: Opcja :option:`data_files` może być użyta aby określić dodatkowe pliki potrzebne przez dystrybucję modułu: pliki konfiguracji, katalogi z wiadomościami, pliki danych, wszystko co nie pasuje do poprzednich kategorii.

source: :option:`data_files` specifies a sequence of (*directory*, *files*) pairs in the following way::
pl: Opcja :option:`data_files` określa sekwencję par (*katalogu*,*plików*) - z ang. - (*directory*,*files*) w następujący sposób::

source: Note that you can specify the directory names where the data files will be installed, but you cannot rename the data files themselves.
pl: Zauważ że możesz podać nazwy katalogu gdzie pliki danych będą instalowane, ale nie możesz zmienić nazwy plików danych samych w sobie.

source: Each (*directory*, *files*) pair in the sequence specifies the installation directory and the files to install there. If *directory* is a relative path, it is interpreted relative to the installation prefix (Python's ``sys.prefix`` for pure-Python packages, ``sys.exec_prefix`` for packages that contain extension modules). Each file name in *files* is interpreted relative to the :file:`setup.py` script at the top of the package source distribution. No directory information from *files* is used to determine the final location of the installed file; only the name of the file is used.
pl: Każda para (*katalog*, *pliki*) w sekwencji określa katalog instalacji i pliki do zainstalowania w nim. Jeśli *katalog* jest ścieżką względną, wtedy jest interpretowany względem przedrostka instalacji (pytonowski ``sys.prefix`` jest dla czysto-pytonowskich pakietów, ``sys.exec_prefix`` dla pakietów zawierających moduły rozszerzające). Każda nazwa pliku w *plikach* jest interpretowana względnie do skryptu :file:`setup.py` na wierzchnim poziomie dystrybucji źródłowej pakietu. Żadna informacja z *plików* nie jest używana aby określić ostateczne przeznaczenie instalowanego pliku; tylko nazwa pliku jest używana.

source: You can specify the :option:`data_files` options as a simple sequence of files without specifying a target directory, but this is not recommended, and the :command:`install` command will print a warning in this case. To install data files directly in the target directory, an empty string should be given as the directory.
pl: Możesz określić opcje :option:`data_files` jako prosty ciąg plików bez określania docelowego katalogu, ale nie jest to zalecane, zaś polecenie :command:`install` wypisze ostrzeżenie w takim przypadku. Aby zainstalować pliki danych bezpośrednio w docelowym katalogu, pusty ciąg znaków powinien zostać podany jako katalog.

source: Additional meta-data
pl: Dodatkowe dane o danych

source: The setup script may include additional meta-data beyond the name and version. This information includes:
pl: Skrypt instalacyjny może zawierać dodatkowe dane pośrednie poza nazwą i wersją. Te informacje zawierają:

source: Meta-Data
pl: dane-o-danych

source: Value
pl: Wartość

source: ``name``
pl: ``nazwa``

source: name of the package
pl: nazwa pakietu

source: short string
pl: krótki ciąg znaków

source: ``version``
pl: ``wersja``

source: version of this release
pl: wersja tego wydania

source: ``author``
pl: ``autor``

source: package author's name
pl: nazwisko i imie autora pakietu

source: ``author_email``
pl: ``adres_email_autora``

source: email address of the package author
pl: adres email autora pakietu

source: email address
pl: adres email

source: ``maintainer``
pl: ``zarządca``

source: package maintainer's name
pl: imie (i nazwisko) zarządcy pakietu

source: ``maintainer_email``
pl: ``adres_email_zarządcy``

source: email address of the package maintainer
pl: adres email zarządcy pakietu

source: home page for the package
pl: adres strony domowej pakietu

source: ``description``
pl: ``opis``

source: short, summary description of the package
pl: krótki opis podsumowujący pakietu

source: ``long_description``
pl: ``dlugi_opis``

source: longer description of the package
pl: dłuższy opis pakietu

source: long string
pl: długi ciąg znaków

source: ``download_url``
pl: ``adres_sciagniecia``

source: location where the package may be downloaded
pl: miejsce skąd pakiet może być pobrany

source: ``classifiers``
pl: ``klasyfikatory``

source: a list of classifiers
pl: lista klasyfikatorów

source: list of strings
pl: lista ciągów znaków

source: ``platforms``
pl: ``maszyny_srodowiska``

source: a list of platforms
pl: lista maszyn/środowisk

source: ``license``
pl: ``licencja``

source: license for the package
pl: licencja pakietu

source: These fields are required.
pl: Te pola są wymagane.

source: It is recommended that versions take the form *major.minor[.patch[.sub]]*.
pl: Jest zalecane aby wersja miała postać *major.minor[.patch[.sub]]*.

source: Either the author or the maintainer must be identified.
pl: Autor albo zarządca muszą być zidentyfikowani

source: These fields should not be used if your package is to be compatible with Python versions prior to 2.2.3 or 2.3. The list is available from the `PyPI website <http://pypi.python.org/pypi>`_.
pl: Te pola nie powinny być używane jeśli pakiet ma być zgodny z wersjami języka pytonowskiego przed 2.2.3 lub 2.3. Lista jest dostępna ze `strony PyPI <http://pypi.python.org/pypi>`_.

source: The ``long_description`` field is used by PyPI when you are registering a package, to build its home page.
pl: Pole ``long_description`` jest używane przez PyPI gdy rejestrujesz pakiet, aby utworzyć jego stronę domową.

source: The ``license`` field is a text indicating the license covering the package where the license is not a selection from the "License" Trove classifiers. See the ``Classifier`` field. Notice that there's a ``licence`` distribution option which is deprecated but still acts as an alias for ``license``.
pl: Pole ``licencja`` - z ang. - ``license`` jest tekstem oznaczającym licencję ochraniającą pakiet gdzie licencja nie jest wybrana z klasyfikacji "Licencji" Znaleźnych. Zobacz pole ``Classifier`` - ``klasyfikator``. Zauważ, że istnieje opcja dystrybucji ``licencji`` która choć jest przestarzała ale wciąż służy jako synonim ``licencji``.

source: A single line of text, not more than 200 characters.
pl: Pojedyncza linia tekstu, nie więcej niż 200 znaków.

source: Multiple lines of plain text in reStructuredText format (see http://docutils.sf.net/).
pl: Wielokrotne linie czystego tekstu w formacie reStructuredText (zob. http://docutils.sf.net/).

source: See below.
pl: Zob poniżej.

source: Encoding the version information is an art in itself. Python packages generally adhere to the version format *major.minor[.patch][sub]*. The major number is 0 for initial, experimental releases of software. It is incremented for releases that represent major milestones in a package. The minor number is incremented when important new features are added to the package. The patch number increments when bug-fix releases are made. Additional trailing version information is sometimes used to indicate sub-releases. These are "a1,a2,...,aN" (for alpha releases, where functionality and API may change), "b1,b2,...,bN" (for beta releases, which only fix bugs) and "pr1,pr2,...,prN" (for final pre-release release testing). Some examples:
pl: Kodowanie informacji o wersji jest sztuką samą w sobie. Pakiety języka pytonowskiego zwykle stosują się do formatu wersji *główna.poboczna[.łatka][pod]*. Główny numer jest 0 w początkowych eksperymentalnych wydaniach oprogramowania. Jest zwiększane dla wydań, które reprezentują główne kroki milowe w pakiecie. Liczba poboczna jest zwiększana gdy istotne nowe własności są dodawane do pakietu. Numer łatki zwiększa się gdy naprawy błędów są robione. Dodatkowe informacje o wersji kończące są czasem używane do zaznaczenia pod-wydań. To są "a1,a2,...,aN" (dla wydań alfa gdzie działanie i sprzęgi programowania mogą ulec zmianie), "b1,b2,...,bN" (dla wydań beta, które tylko naprawiają błędy) i "pr1,pr2,...,prN" (dla końcowych testów wydań przed-wydaniem). Niektóre przykłady:
